PCIe_4.0_Switch/P360_12700/test_randread_4k.fio.txt
+ sudo /usr/bin/time -v fio randread_4k.fio
nvme0n1p1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
nvme1n1p1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
nvme2n1p1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
nvme3n1p1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
nvme4n1p1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
nvme5n1p1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
nvme6n1p1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
nvme7n1p1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.36
Starting 16 processes

nvme0n1p1: (groupid=0, jobs=1): err= 0: pid=3412: Mon Apr 28 00:25:59 2025
  read: IOPS=84.4k, BW=330MiB/s (346MB/s)(6595MiB/20001msec)
    slat (nsec): min=753, max=58799, avg=1375.80, stdev=643.47
    clat (usec): min=182, max=4859, avg=756.36, stdev=126.20
     lat (usec): min=184, max=4867, avg=757.74, stdev=126.20
    clat percentiles (usec):
     |  1.00th=[  469],  5.00th=[  594], 10.00th=[  635], 20.00th=[  676],
     | 30.00th=[  701], 40.00th=[  717], 50.00th=[  734], 60.00th=[  758],
     | 70.00th=[  783], 80.00th=[  824], 90.00th=[  930], 95.00th=[ 1020],
     | 99.00th=[ 1139], 99.50th=[ 1172], 99.90th=[ 1221], 99.95th=[ 1237],
     | 99.99th=[ 1287]
   bw (  KiB/s): min=329000, max=392832, per=3.02%, avg=338079.38, stdev=11070.79, samples=39
   iops        : min=82250, max=98208, avg=84519.85, stdev=2767.69, samples=39
  lat (usec)   : 250=0.01%, 500=1.63%, 750=55.03%, 1000=37.55%
  lat (msec)   : 2=5.78%, 10=0.01%
  cpu          : usr=6.69%, sys=14.97%, ctx=206067, majf=0, minf=81
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=1688329,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme0n1p1: (groupid=0, jobs=1): err= 0: pid=3413: Mon Apr 28 00:25:59 2025
  read: IOPS=84.4k, BW=330MiB/s (346MB/s)(6593MiB/20001msec)
    slat (nsec): min=749, max=86861, avg=1380.28, stdev=646.16
    clat (usec): min=207, max=5758, avg=756.62, stdev=127.58
     lat (usec): min=208, max=5764, avg=758.00, stdev=127.58
    clat percentiles (usec):
     |  1.00th=[  469],  5.00th=[  594], 10.00th=[  635], 20.00th=[  676],
     | 30.00th=[  701], 40.00th=[  717], 50.00th=[  734], 60.00th=[  758],
     | 70.00th=[  783], 80.00th=[  824], 90.00th=[  930], 95.00th=[ 1020],
     | 99.00th=[ 1139], 99.50th=[ 1172], 99.90th=[ 1221], 99.95th=[ 1237],
     | 99.99th=[ 1287]
   bw (  KiB/s): min=328768, max=395440, per=3.02%, avg=337969.03, stdev=11448.61, samples=39
   iops        : min=82192, max=98860, avg=84492.26, stdev=2862.15, samples=39
  lat (usec)   : 250=0.01%, 500=1.65%, 750=54.85%, 1000=37.68%
  lat (msec)   : 2=5.82%, 10=0.01%
  cpu          : usr=6.64%, sys=15.05%, ctx=206697, majf=0, minf=78
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=1687833,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme1n1p1: (groupid=0, jobs=1): err= 0: pid=3414: Mon Apr 28 00:25:59 2025
  read: IOPS=204k, BW=796MiB/s (835MB/s)(15.5GiB/20001msec)
    slat (nsec): min=747, max=183325, avg=1315.56, stdev=851.78
    clat (usec): min=72, max=22820, avg=312.27, stdev=110.71
     lat (usec): min=74, max=22827, avg=313.58, stdev=110.75
    clat percentiles (usec):
     |  1.00th=[  223],  5.00th=[  245], 10.00th=[  255], 20.00th=[  269],
     | 30.00th=[  277], 40.00th=[  289], 50.00th=[  297], 60.00th=[  310],
     | 70.00th=[  322], 80.00th=[  347], 90.00th=[  388], 95.00th=[  424],
     | 99.00th=[  537], 99.50th=[  660], 99.90th=[  889], 99.95th=[ 1012],
     | 99.99th=[ 1287]
   bw (  KiB/s): min=441552, max=886800, per=7.27%, avg=814542.15, stdev=74150.28, samples=39
   iops        : min=110388, max=221702, avg=203635.54, stdev=18537.63, samples=39
  lat (usec)   : 100=0.01%, 250=7.04%, 500=91.56%, 750=1.18%, 1000=0.17%
  lat (msec)   : 2=0.05%, 4=0.01%, 50=0.01%
  cpu          : usr=14.65%, sys=31.80%, ctx=200397, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=4076169,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme1n1p1: (groupid=0, jobs=1): err= 0: pid=3415: Mon Apr 28 00:25:59 2025
  read: IOPS=204k, BW=797MiB/s (836MB/s)(15.6GiB/20001msec)
    slat (nsec): min=753, max=170566, avg=1294.60, stdev=884.25
    clat (usec): min=81, max=19654, avg=311.86, stdev=100.65
     lat (usec): min=81, max=19660, avg=313.16, stdev=100.70
    clat percentiles (usec):
     |  1.00th=[  223],  5.00th=[  245], 10.00th=[  255], 20.00th=[  269],
     | 30.00th=[  277], 40.00th=[  289], 50.00th=[  297], 60.00th=[  306],
     | 70.00th=[  322], 80.00th=[  347], 90.00th=[  388], 95.00th=[  424],
     | 99.00th=[  537], 99.50th=[  660], 99.90th=[  889], 99.95th=[ 1012],
     | 99.99th=[ 1303]
   bw (  KiB/s): min=444424, max=887144, per=7.28%, avg=815661.13, stdev=74881.09, samples=39
   iops        : min=111106, max=221786, avg=203915.28, stdev=18720.27, samples=39
  lat (usec)   : 100=0.01%, 250=7.04%, 500=91.56%, 750=1.18%, 1000=0.17%
  lat (msec)   : 2=0.05%, 4=0.01%, 20=0.01%
  cpu          : usr=14.96%, sys=30.91%, ctx=203729, majf=0, minf=80
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=4081089,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme2n1p1: (groupid=0, jobs=1): err= 0: pid=3416: Mon Apr 28 00:25:59 2025
  read: IOPS=276k, BW=1079MiB/s (1131MB/s)(21.1GiB/20001msec)
    slat (nsec): min=766, max=165244, avg=1437.53, stdev=896.19
    clat (usec): min=21, max=2827, avg=229.81, stdev=90.64
     lat (usec): min=22, max=2830, avg=231.25, stdev=90.67
    clat percentiles (usec):
     |  1.00th=[   72],  5.00th=[  130], 10.00th=[  163], 20.00th=[  202],
     | 30.00th=[  210], 40.00th=[  217], 50.00th=[  221], 60.00th=[  225],
     | 70.00th=[  231], 80.00th=[  239], 90.00th=[  281], 95.00th=[  367],
     | 99.00th=[  635], 99.50th=[  750], 99.90th=[ 1045], 99.95th=[ 1172],
     | 99.99th=[ 1467]
   bw (  MiB/s): min=  953, max= 1187, per=9.87%, avg=1079.53, stdev=58.42, samples=39
   iops        : min=244028, max=304126, avg=276359.95, stdev=14956.09, samples=39
  lat (usec)   : 50=0.01%, 100=4.38%, 250=81.40%, 500=12.17%, 750=1.55%
  lat (usec)   : 1000=0.38%
  lat (msec)   : 2=0.13%, 4=0.01%
  cpu          : usr=22.30%, sys=52.20%, ctx=1355918, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=5523606,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme2n1p1: (groupid=0, jobs=1): err= 0: pid=3417: Mon Apr 28 00:25:59 2025
  read: IOPS=276k, BW=1078MiB/s (1131MB/s)(21.1GiB/20001msec)
    slat (nsec): min=770, max=464311, avg=1427.51, stdev=952.48
    clat (usec): min=48, max=4378, avg=229.94, stdev=91.62
     lat (usec): min=50, max=4382, avg=231.37, stdev=91.66
    clat percentiles (usec):
     |  1.00th=[   72],  5.00th=[  133], 10.00th=[  163], 20.00th=[  202],
     | 30.00th=[  210], 40.00th=[  217], 50.00th=[  221], 60.00th=[  225],
     | 70.00th=[  231], 80.00th=[  239], 90.00th=[  281], 95.00th=[  371],
     | 99.00th=[  635], 99.50th=[  750], 99.90th=[ 1045], 99.95th=[ 1172],
     | 99.99th=[ 1483]
   bw (  MiB/s): min=  994, max= 1179, per=9.87%, avg=1079.16, stdev=53.36, samples=39
   iops        : min=254712, max=302038, avg=276264.92, stdev=13661.25, samples=39
  lat (usec)   : 50=0.01%, 100=4.30%, 250=81.91%, 500=11.70%, 750=1.58%
  lat (usec)   : 1000=0.38%
  lat (msec)   : 2=0.13%, 4=0.01%, 10=0.01%
  cpu          : usr=21.55%, sys=52.62%, ctx=1371994, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=5520867,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme3n1p1: (groupid=0, jobs=1): err= 0: pid=3418: Mon Apr 28 00:25:59 2025
  read: IOPS=235k, BW=918MiB/s (963MB/s)(17.9GiB/20001msec)
    slat (nsec): min=765, max=315877, avg=1478.64, stdev=1030.92
    clat (usec): min=10, max=11539, avg=270.22, stdev=53.57
     lat (usec): min=11, max=11543, avg=271.70, stdev=53.60
    clat percentiles (usec):
     |  1.00th=[  188],  5.00th=[  233], 10.00th=[  241], 20.00th=[  251],
     | 30.00th=[  260], 40.00th=[  265], 50.00th=[  269], 60.00th=[  273],
     | 70.00th=[  281], 80.00th=[  289], 90.00th=[  302], 95.00th=[  314],
     | 99.00th=[  347], 99.50th=[  367], 99.90th=[  486], 99.95th=[  502],
     | 99.99th=[ 1516]
   bw (  KiB/s): min=811976, max=1052336, per=8.40%, avg=941401.64, stdev=55104.06, samples=39
   iops        : min=202994, max=263084, avg=235350.41, stdev=13775.95, samples=39
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=18.14%, 500=81.80%
  lat (usec)   : 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.03%, 20=0.01%
  cpu          : usr=19.95%, sys=44.39%, ctx=752231, majf=0, minf=80
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=4701935,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme3n1p1: (groupid=0, jobs=1): err= 0: pid=3419: Mon Apr 28 00:25:59 2025
  read: IOPS=235k, BW=919MiB/s (964MB/s)(18.0GiB/20001msec)
    slat (nsec): min=769, max=139104, avg=1444.02, stdev=974.84
    clat (usec): min=10, max=11676, avg=270.06, stdev=53.16
     lat (usec): min=12, max=11679, avg=271.50, stdev=53.18
    clat percentiles (usec):
     |  1.00th=[  192],  5.00th=[  235], 10.00th=[  243], 20.00th=[  251],
     | 30.00th=[  258], 40.00th=[  265], 50.00th=[  269], 60.00th=[  273],
     | 70.00th=[  281], 80.00th=[  289], 90.00th=[  302], 95.00th=[  314],
     | 99.00th=[  347], 99.50th=[  367], 99.90th=[  490], 99.95th=[  545],
     | 99.99th=[ 1516]
   bw (  KiB/s): min=807536, max=1036392, per=8.41%, avg=942091.77, stdev=53552.38, samples=39
   iops        : min=201884, max=259098, avg=235522.92, stdev=13388.07, samples=39
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=17.79%, 500=82.13%
  lat (usec)   : 750=0.04%
  lat (msec)   : 2=0.03%, 20=0.01%
  cpu          : usr=19.75%, sys=43.45%, ctx=774343, majf=0, minf=77
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=4705584,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme4n1p1: (groupid=0, jobs=1): err= 0: pid=3420: Mon Apr 28 00:25:59 2025
  read: IOPS=150k, BW=587MiB/s (616MB/s)(11.5GiB/20001msec)
    slat (nsec): min=740, max=160234, avg=1480.05, stdev=922.22
    clat (usec): min=16, max=8054, avg=423.82, stdev=66.16
     lat (usec): min=30, max=8056, avg=425.30, stdev=66.13
    clat percentiles (usec):
     |  1.00th=[  153],  5.00th=[  392], 10.00th=[  404], 20.00th=[  412],
     | 30.00th=[  416], 40.00th=[  420], 50.00th=[  424], 60.00th=[  424],
     | 70.00th=[  429], 80.00th=[  433], 90.00th=[  457], 95.00th=[  486],
     | 99.00th=[  611], 99.50th=[  652], 99.90th=[  783], 99.95th=[  832],
     | 99.99th=[  947]
   bw (  KiB/s): min=588232, max=613648, per=5.37%, avg=601505.33, stdev=5193.28, samples=39
   iops        : min=147058, max=153412, avg=150376.23, stdev=1298.30, samples=39
  lat (usec)   : 20=0.01%, 50=0.05%, 100=0.46%, 250=1.33%, 500=94.30%
  lat (usec)   : 750=3.70%, 1000=0.15%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=14.23%, sys=32.14%, ctx=994575, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=3006445,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme4n1p1: (groupid=0, jobs=1): err= 0: pid=3421: Mon Apr 28 00:25:59 2025
  read: IOPS=150k, BW=585MiB/s (614MB/s)(11.4GiB/20001msec)
    slat (nsec): min=740, max=123102, avg=1431.53, stdev=867.59
    clat (usec): min=20, max=5875, avg=425.25, stdev=59.97
     lat (usec): min=32, max=5924, avg=426.68, stdev=59.94
    clat percentiles (usec):
     |  1.00th=[  174],  5.00th=[  396], 10.00th=[  404], 20.00th=[  412],
     | 30.00th=[  416], 40.00th=[  420], 50.00th=[  424], 60.00th=[  424],
     | 70.00th=[  429], 80.00th=[  433], 90.00th=[  457], 95.00th=[  486],
     | 99.00th=[  611], 99.50th=[  652], 99.90th=[  791], 99.95th=[  840],
     | 99.99th=[  947]
   bw (  KiB/s): min=585984, max=613272, per=5.36%, avg=599961.18, stdev=5472.78, samples=39
   iops        : min=146496, max=153318, avg=149990.28, stdev=1368.17, samples=39
  lat (usec)   : 50=0.05%, 100=0.39%, 250=1.12%, 500=94.38%, 750=3.90%
  lat (usec)   : 1000=0.16%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=13.68%, sys=31.40%, ctx=1005637, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=2996457,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme5n1p1: (groupid=0, jobs=1): err= 0: pid=3422: Mon Apr 28 00:25:59 2025
  read: IOPS=150k, BW=586MiB/s (614MB/s)(11.4GiB/20000msec)
    slat (nsec): min=745, max=211838, avg=1464.22, stdev=895.82
    clat (usec): min=13, max=2310, avg=424.85, stdev=60.12
     lat (usec): min=14, max=2314, avg=426.31, stdev=60.09
    clat percentiles (usec):
     |  1.00th=[  147],  5.00th=[  392], 10.00th=[  404], 20.00th=[  412],
     | 30.00th=[  416], 40.00th=[  420], 50.00th=[  424], 60.00th=[  424],
     | 70.00th=[  429], 80.00th=[  433], 90.00th=[  461], 95.00th=[  494],
     | 99.00th=[  619], 99.50th=[  668], 99.90th=[  791], 99.95th=[  840],
     | 99.99th=[  938]
   bw (  KiB/s): min=590968, max=614356, per=5.36%, avg=600038.87, stdev=4796.70, samples=39
   iops        : min=147742, max=153589, avg=150009.72, stdev=1199.17, samples=39
  lat (usec)   : 20=0.01%, 50=0.05%, 100=0.48%, 250=1.42%, 500=93.27%
  lat (usec)   : 750=4.59%, 1000=0.19%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=14.02%, sys=31.82%, ctx=972568, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=2999041,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme5n1p1: (groupid=0, jobs=1): err= 0: pid=3423: Mon Apr 28 00:25:59 2025
  read: IOPS=150k, BW=588MiB/s (616MB/s)(11.5GiB/20001msec)
    slat (nsec): min=740, max=165880, avg=1523.09, stdev=957.01
    clat (usec): min=21, max=8106, avg=423.44, stdev=70.52
     lat (usec): min=30, max=8151, avg=424.96, stdev=70.49
    clat percentiles (usec):
     |  1.00th=[  137],  5.00th=[  383], 10.00th=[  404], 20.00th=[  412],
     | 30.00th=[  416], 40.00th=[  420], 50.00th=[  424], 60.00th=[  424],
     | 70.00th=[  429], 80.00th=[  433], 90.00th=[  461], 95.00th=[  490],
     | 99.00th=[  619], 99.50th=[  668], 99.90th=[  807], 99.95th=[  857],
     | 99.99th=[  988]
   bw (  KiB/s): min=589744, max=638392, per=5.38%, avg=602354.67, stdev=7511.51, samples=39
   iops        : min=147436, max=159598, avg=150588.67, stdev=1877.88, samples=39
  lat (usec)   : 50=0.06%, 100=0.53%, 250=1.66%, 500=93.23%, 750=4.32%
  lat (usec)   : 1000=0.20%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=14.82%, sys=32.88%, ctx=951143, majf=0, minf=78
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=3008904,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme6n1p1: (groupid=0, jobs=1): err= 0: pid=3424: Mon Apr 28 00:25:59 2025
  read: IOPS=150k, BW=586MiB/s (615MB/s)(11.4GiB/20001msec)
    slat (nsec): min=752, max=98572, avg=1471.81, stdev=880.60
    clat (usec): min=24, max=8011, avg=424.65, stdev=67.16
     lat (usec): min=31, max=8070, avg=426.13, stdev=67.13
    clat percentiles (usec):
     |  1.00th=[  157],  5.00th=[  392], 10.00th=[  404], 20.00th=[  412],
     | 30.00th=[  416], 40.00th=[  420], 50.00th=[  424], 60.00th=[  424],
     | 70.00th=[  429], 80.00th=[  433], 90.00th=[  461], 95.00th=[  490],
     | 99.00th=[  619], 99.50th=[  660], 99.90th=[  791], 99.95th=[  832],
     | 99.99th=[  963]
   bw (  KiB/s): min=592336, max=616745, per=5.36%, avg=600532.74, stdev=4729.07, samples=39
   iops        : min=148084, max=154186, avg=150133.18, stdev=1182.24, samples=39
  lat (usec)   : 50=0.05%, 100=0.45%, 250=1.35%, 500=93.81%, 750=4.18%
  lat (usec)   : 1000=0.16%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=13.66%, sys=32.35%, ctx=972758, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=3000688,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme6n1p1: (groupid=0, jobs=1): err= 0: pid=3425: Mon Apr 28 00:25:59 2025
  read: IOPS=150k, BW=587MiB/s (616MB/s)(11.5GiB/20001msec)
    slat (nsec): min=751, max=63848, avg=1438.35, stdev=864.48
    clat (usec): min=22, max=7302, avg=423.77, stdev=66.39
     lat (usec): min=31, max=7342, avg=425.21, stdev=66.35
    clat percentiles (usec):
     |  1.00th=[  147],  5.00th=[  392], 10.00th=[  404], 20.00th=[  412],
     | 30.00th=[  416], 40.00th=[  420], 50.00th=[  424], 60.00th=[  424],
     | 70.00th=[  429], 80.00th=[  433], 90.00th=[  461], 95.00th=[  486],
     | 99.00th=[  619], 99.50th=[  660], 99.90th=[  799], 99.95th=[  840],
     | 99.99th=[  963]
   bw (  KiB/s): min=590376, max=632504, per=5.37%, avg=601974.56, stdev=6728.63, samples=39
   iops        : min=147594, max=158126, avg=150493.64, stdev=1682.16, samples=39
  lat (usec)   : 50=0.06%, 100=0.49%, 250=1.49%, 500=93.77%, 750=4.01%
  lat (usec)   : 1000=0.18%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=13.47%, sys=31.74%, ctx=984693, majf=0, minf=78
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=3007114,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme7n1p1: (groupid=0, jobs=1): err= 0: pid=3426: Mon Apr 28 00:25:59 2025
  read: IOPS=150k, BW=586MiB/s (614MB/s)(11.4GiB/20001msec)
    slat (nsec): min=747, max=1082.3k, avg=1427.16, stdev=1101.36
    clat (usec): min=14, max=8101, avg=424.97, stdev=67.60
     lat (usec): min=30, max=8141, avg=426.40, stdev=67.57
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  392], 10.00th=[  404], 20.00th=[  412],
     | 30.00th=[  416], 40.00th=[  420], 50.00th=[  424], 60.00th=[  424],
     | 70.00th=[  429], 80.00th=[  433], 90.00th=[  461], 95.00th=[  490],
     | 99.00th=[  619], 99.50th=[  660], 99.90th=[  799], 99.95th=[  848],
     | 99.99th=[ 1057]
   bw (  KiB/s): min=590144, max=630256, per=5.36%, avg=600141.33, stdev=6493.96, samples=39
   iops        : min=147536, max=157564, avg=150035.38, stdev=1623.50, samples=39
  lat (usec)   : 20=0.01%, 50=0.05%, 100=0.43%, 250=1.33%, 500=93.87%
  lat (usec)   : 750=4.13%, 1000=0.18%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=13.60%, sys=31.30%, ctx=986195, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=2998739,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
nvme7n1p1: (groupid=0, jobs=1): err= 0: pid=3427: Mon Apr 28 00:25:59 2025
  read: IOPS=150k, BW=588MiB/s (616MB/s)(11.5GiB/20001msec)
    slat (nsec): min=751, max=157334, avg=1497.94, stdev=917.10
    clat (usec): min=17, max=7830, avg=423.45, stdev=67.42
     lat (usec): min=30, max=7848, avg=424.94, stdev=67.39
    clat percentiles (usec):
     |  1.00th=[  149],  5.00th=[  388], 10.00th=[  404], 20.00th=[  412],
     | 30.00th=[  416], 40.00th=[  420], 50.00th=[  424], 60.00th=[  424],
     | 70.00th=[  429], 80.00th=[  433], 90.00th=[  457], 95.00th=[  486],
     | 99.00th=[  611], 99.50th=[  660], 99.90th=[  791], 99.95th=[  840],
     | 99.99th=[  971]
   bw (  KiB/s): min=591536, max=627848, per=5.38%, avg=602336.62, stdev=5911.91, samples=39
   iops        : min=147884, max=156962, avg=150584.15, stdev=1477.98, samples=39
  lat (usec)   : 20=0.01%, 50=0.05%, 100=0.48%, 250=1.49%, 500=93.93%
  lat (usec)   : 750=3.87%, 1000=0.17%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=13.89%, sys=32.92%, ctx=966876, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=3008876,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=10.7GiB/s (11.5GB/s), 330MiB/s-1079MiB/s (346MB/s-1131MB/s), io=214GiB (229GB), run=20000-20001msec

Disk stats (read/write):
  nvme0n1: ios=3348874/0, sectors=26790992/0, merge=0/0, ticks=2458905/0, in_queue=2458905, util=99.28%
  nvme1n1: ios=8074097/0, sectors=64592776/0, merge=0/0, ticks=2321593/0, in_queue=2321593, util=99.22%
  nvme2n1: ios=10941126/0, sectors=87529008/0, merge=0/0, ticks=2431749/0, in_queue=2431749, util=99.29%
  nvme3n1: ios=9322641/0, sectors=74581128/0, merge=0/0, ticks=2442192/0, in_queue=2442192, util=99.28%
  nvme4n1: ios=5952129/0, sectors=47617032/0, merge=0/0, ticks=2499868/0, in_queue=2499868, util=99.42%
  nvme5n1: ios=5957155/0, sectors=47657240/0, merge=0/0, ticks=2497691/0, in_queue=2497691, util=99.46%
  nvme6n1: ios=5957555/0, sectors=47660440/0, merge=0/0, ticks=2500133/0, in_queue=2500133, util=99.46%
  nvme7n1: ios=5957315/0, sectors=47658520/0, merge=0/0, ticks=2499563/0, in_queue=2499563, util=99.50%
	Command being timed: "fio randread_4k.fio"
	User time (seconds): 47.82
	System time (seconds): 108.76
	Percent of CPU this job got: 731%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 0:21.41
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 69160
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 0
	Minor (reclaiming a frame) page faults: 133740
	Voluntary context switches: 12894286
	Involuntary context switches: 14002
	Swaps: 0
	File system inputs: 448093408
	File system outputs: 0
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0